Revit 2024 API
NavisworksCoordinates Enumeration
 An enumerated type listing possible Coordinates of Navisworks Exporter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Since: 2014
Syntax
C#
public enum NavisworksCoordinates
Visual Basic
Public Enumeration NavisworksCoordinates
Visual C++
public enum class NavisworksCoordinates
Members
Member name | Description
Internal |  Use Revit internal coordinates.
Shared |  Shared coordinates can be viewed and modified outside of Revit.
See Also
Autodesk.Revit.DB Namespace